import Accordion from "react-bootstrap/Accordion";
import "bootstrap/dist/css/bootstrap.min.css";
import "./App.css";

function Dropdown3() {
  return (
    <Accordion className="accordation-">
      <Accordion.Item className="bg" eventKey="0">
        <Accordion.Header style={{ fontSize: "2rem" }}>
          كيف أقوم بإضافة و تحيث بيانات الفرع
        </Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية الشركة ثم اختر الفروع سيقوم النظام بعرض جميع
          بيانات الفروع قم بالضغط على ( + ) سوف يقوم النظام بفتح صفحة جديدة
          لتعبئة بيانات فرع جديد، وعند القيام بحفظ بيانات الفرع الجديد سيقوم
          النظام بفتح ملفات للمستندات ، و لتحديث بيانات الفرع قم باختيار الفرع
          ستظهر بيانات الفرع للتحديث ملحوظة: (عند إيقاف الفرع لن يتمكن من إنشاء
          عقود تأجير جديدة، وسيتم إيقاف التعامل مع نقاط البيع التابعة للفرع ،
          كذلك لايمكن حذف فرع و مرتبط به نقاط بيع أو سيارات )
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="1">
        <Accordion.Header>كيف أقوم بتحديث مستندات الشركة</Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية الشركة ثم اختر المستندات سيقوم النظام بعرض
          جميع بيانات المستندات التي لم تسجل أو المنتهية أو على وشك الانتهاء ، (
          في حالة الرغبة بعرض البقية قم باختيار التصفية ) ، اختر المستند المحدد
          ستظهر لك صفحة تمكنك هذه الصفحة من تحديث بيانات أو حذف المستند
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="2">
        <Accordion.Header>
          كيف أقوم بإضافة او تحديث بيانات مالك
        </Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية الشركة ثم اختر الملاك سيقوم النظام بعرض جميع
          بيانات الملاك قم بالضغط على ( + ) سوف يقوم النظام بفتح صفحة جديدة
          لتعبئة بيانات المالك الجديد ، و لتحديث بيانات المالك قم باختيار المالك
          ستظهر بيانات المالك للتحديث ملحوظة: (عند إيقاف المالك لن يتمكن من
          إنشاء عقود تأجير جديدة ترجع ملكيتها للمالك الموقوف، كذلك لايمكن حذف
          مالك و لدية سيارات )
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="3">
        <Accordion.Header>كيف أقوم بإضافة و تحيث بيانات سيارة</Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية السيارات ثم اختر بيانات السيارات سيقوم النظام
          بعرض جميع بيانات السيارات قم بالضغط على ( + ) سوف يقوم النظام بفتح
          صفحة جديدة لتعبئة بيانات سيارة جديدة، وعند القيام بحفظ بيانات السيارة
          الجديدة في الفرع الرئيسي ، كذلك سيقوم النظام بفتح ملفات للوثائق و
          جدولة الصيانة الخاصة بالسيارة ، و لتحديث بيانات السيارة قم باختيار
          السيارة ستظهر بيانات السيارة للتحديث ملحوظة: (عند إيقاف السيارة لن يتم
          تأجير السيارة كذلك في حالة نقلها للصيانة وعند عرضها للبيع سيتم ايقاف
          عملية التأجير و عرضها بمنصة بيع السيارات )
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="4">
        <Accordion.Header>كيف أقوم بتحديث وثائق السيارة</Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية السيارات ثم اختر الوثائق سيقوم النظام بعرض
          جميع بيانات وثائق السيارات التي لم تسجل أو المنتهية أو على وشك
          الانتهاء ، ( في حالة الرغبة بعرض البقية قم باختيار من خلال التصفية ) ،
          اختر وثيقة السيارة المرغوبه ستظهر لك صفحة تمكنك هذه الصفحة من تحديث
          بيانات أو حذف الوثيقة
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="5">
        <Accordion.Header>كيف أقوم بتحديث صيانة السيارة</Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية السيارات ثم اختر الصيانة سيقوم النظام بعرض
          جميع بيانات بنود صيانة السيارات التي لم تسجل أو المنتهية أو على وشك
          الانتهاء ، ( في حالة الرغبة بعرض البقية قم باختيار من خلال التصفية ) ،
          اختر السيارة تحديث بيانات الصيانة ستظهر لك صفحة تمكنك هذه الصفحة من
          تحديث بيانات أو حذف الصيانة
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="6">
        <Accordion.Header>كيف أقوم بنقل سيارة من فرع إلى فرع</Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية السيارات ثم اختر نقل سيارة سيقوم النظام بعرض
          جميع بيانات السيارات التي حالتها نشط ، اختر السيارة المراد نقلها ستظهر
          لك صفحة تمكنك من تحديد الفرع الجديد
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="7">
        <Accordion.Header>كيف أقوم بتغيير مالك السيارة</Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية السيارات ثم اخترتغيير مالك سيقوم النظام بعرض
          جميع بيانات السيارات التي حالتها نشط ، اختر السيارة المراد تغيير
          مالكها ستظهر لك صفحة تمكنك من تحديد المالك الجديد
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="8">
        <Accordion.Header>
          كيف أقوم بإضافة و تحيث بيانات مستأجر
        </Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية المستأجرين ثم اختر بيانات المستأجرين سيقوم
          النظام بعرض جميع بيانات المستأجرين ملحوظة:( يتم اضافة بيانات المستأجر
          من خلال شاشة انشاء عقد فقط) , قم باختيار مستأجر لتعديل البيانات
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="9">
        <Accordion.Header>كيف أقوم بتغذية الصندوق</Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية الحسابات ثم اختر تغذية الصندوق سوف تظهر لك
          قائمة بالموظفين أختر الموظف المراد تغذية صندوقه ملحوظة: (لا يعرض
          الموظفين الذي لديه تغذية قائمة ) سوف تظهر لك صفحة تمكنك من إجراء عملية
          التغذية
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="10">
        <Accordion.Header>كيف أقوم باستلام عهدة</Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الحسابات ثم اختر استلام العهدة سوف تظهر لك قائمة
          بالعهد المرسلة من الموظفين بنظام الفروع قم باختيار العهدة المراد
          استلامها سوف تظهر القيود المالية المرسلة من الموظف من خلال الصفحة
          تمكنك من قبول أو رفض استلام العهدة
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="11">
        <Accordion.Header>كيف أقوم بتسجيل حواله إلى مستأجر</Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الحسابات ثم اختر تحويل إلى مستأجر سوف تظهر لك جميع
          بيانات المستأجرين الذين لديهم عقود قائمة اختر المستأجر ستفتح لك صفحة
          تمكنك من إجراء عملية التحويل
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="12">
        <Accordion.Header>كيف أقوم بتسجيل حواله من المستأجر</Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الحسابات ثم اختر تحويل من مستأجر سوف تظهر لك بيانات
          المستأجرين المستأجر ستفتح لك صفحة تمكنك من إجراء عملية التحويل
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="13">
        <Accordion.Header>
          كيف أقوم بإضافة وتحديث بيانات مستخدم
        </Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية المستخدمين ثم اختر المستخدمين ستظهر لك صفحة
          تمكنك هذه الصفحة من إضافة او تحديث بيانات مستخدم ثم حفظ. ملحوظة: (لا
          يمكن حذف مستخدم لديه رصيد/عهدة)
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="14">
        <Accordion.Header>كيف أقوم بمنح صلاحية العقد للمستخدم</Accordion.Header>
        <Accordion.Body>
          اختر قائمة المستخدمين ثم اختر صلاحية العقد ثم اختر المستخدم المراد
          منحه صلاحيات ثم اختر الصلاحيات التي امنحها له
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="15">
        <Accordion.Header>كيف أقوم بتحديث التنبيهات</Accordion.Header>
        <Accordion.Body>
          اختر قائمة الخدمات ثم اختر التنبيهات ستظهر لك صفحة تمكنك من تفعيل
          البند و تحديد عدد الأيام قبل التنبيه للمستند او الوثائق كذلك الصيانة
          تحديد عدد الكيلوات لتنبيه
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="16">
        <Accordion.Header>كيف أقوم بتحديث شروط العضوية</Accordion.Header>
        <Accordion.Body>
          اختر قائمة الخدمات ثم اختر شروط العضوبة ستظهر لك صفحة تمكنك من تفعيل
          العضوية و تحديد الشروط التي في حالة تحققها لدى المستأجر عند أغلاق
          العقد سوف تمنح له
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="17">
        <Accordion.Header>كيف أقوم بإضافة وتحديث حساب بنكي</Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية الخدمات ثم اختر بنوك سيقوم النظام بعرض جميع
          بيانات الحسابات البنكية قم بالضغط على ( + ) سوف يقوم النظام بفتح صفحة
          جديدة لتعبئة بيانات الحساب البنكي الجديد ، ولجراء عملية التعديل أو
          الإيقاف أو الحذف اختر من عرض بيانات الملاك تفتح لك صفحة لإجراء التعديل
          ، ملحوظة: (عند إيقاف حساب بنكي سيتم ايقاف جميع نقاط البيع المرتبطة
          بالحساب البنكي ، كذلك لايمكن حذف حساب بنكي مرتبط بنقاط بيع )
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="18">
        <Accordion.Header>كيف أقوم بإضافة وتحديث نقاط البيع</Accordion.Header>
        <Accordion.Body>
          اختر من القائمة الرئيسية الخدمات ثم اختر نقاط البيع سيقوم النظام بعرض
          جميع بياناتنقاط البيع قم بالضغط على ( + ) سوف يقوم النظام بفتح صفحة
          جديدة لتعبئة بيانات نقاطة البيع الجديدة ، ولجراء عملية التعديل أو
          الإيقاف أو الحذف اختر من عرض بيانات نقاطة البيع تفتح لك صفحة لإجراء
          التعديل ، ملحوظة: (عند إيقاف نقطة البيع سيتم ايقاف التعامل مع نقطة
          البيع ، كذلك لايمكن حذف نقطة بيع لديها رصيد أو تم إجراء عملية تسليم )
          .
        </Accordion.Body>
      </Accordion.Item>
    </Accordion>
  );
}

export default Dropdown3;
